      * ARITHMETIC statements in cobol:
           *> ADD STATEMENT
           *> SUBTRACT STATEMENT
           *> MULTIPLE STATEMENT
           *> DIVISION STATEMENT
           *> COMPUTE STATEMENT

       *> OPERATIONS: ADD, SUBTRACT, MULTIPLE, DIVISION
       *> OPERATION SIGN: +, -, *, /
       *> HELPER-WORD: TO, FROM, BY

       *> OPERATION A HELPER-WORD B  ( B = B OPERATION SIGN A)
       *> OPERATION A HELPER-WORD B GIVING C (C = B OPERATION SIGN A) = OPERATION A B GIVING C.
       *> OPERATION A HELPER-WORD B ROUNDED C
       *> COMPUTE = A OPERATION SIGN B
       *> OPERATION A HELPER-WORD B ON SIZE ERROR DISPLAY "MESSAGE"
       *> OPERATION A HELPER-WORD B GIVING C ON SIZE ERROR DISPLAY "MESSAGE"
       *> COMPUTE C = A + B ON SIZE ERROR DISPLAY "MESSAGE"

       IDENTIFICATION DIVISION.
       PROGRAM-ID. ARITHMETICS-STATEMENT-LEARN.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
