       IDENTIFICATION DIVISION.
       PROGRAM-ID. DIVISION-STATEMENT-LEARN.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  A PIC 99 VALUE 24.
       01  B PIC 99 VALUE 25.
       01  P PIC 9V9 VALUE 8.7.
       01  Q PIC 9V9 VALUE 2.3.
       01  C PIC 99 VALUE ZEROES.
       01  D PIC 99 VALUE ZEROES.
       01  M PIC 9 VALUE ZEROES.

       PROCEDURE DIVISION.
           *>DIVIDE 4 INTO A.
           DIVIDE A BY 4 GIVING C.
           DIVIDE B BY 4 GIVING C REMAINDER D.
           DIVIDE P BY Q GIVING M ROUNDED.

           DISPLAY "VALUE OF A IS: " A.
           DISPLAY "VALUE OF C IS: " C.
           DISPLAY "VALUE OF D IS: " D.
           DISPLAY "VALUE OF M IS: " M.

           STOP RUN.
