       IDENTIFICATION DIVISION.
       PROGRAM-ID. FUNCTIONS.

      *> There are 42 in-built functions in cobol.
      *> They are also called intrinsic functions.
      *> Syntax:  FUNCTION function-name (arguments)
      *> You can use comma or space to seperate the arguments.
      *> Functions can be used within a compute statement.
