       IDENTIFICATION DIVISION.    *> Identifying the program
       PROGRAM-ID. HelloWorld.     *> Name of the program
       PROCEDURE DIVISION.         *> Real code start from here
           DISPLAY "Hello World".
           STOP RUN.               *> End of the program


           *> COBOL => COmmon Business Oriented Language
           *> It is a high level language
           *> It is an English-like language
           *> COBOL can handle huge data
           *> JCL is required to execute the COBOL
