       IDENTIFICATION DIVISION.
       PROGRAM-ID. PERFORM-STOP-RUN-LEARN.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  NUM PIC 9(10).
       01  STR PIC X(10).

       PROCEDURE DIVISION.
       000-MAIN-PROCEDURE.
           PERFORM 100-TAKE-NUMBER.
           PERFORM 200-TAKE-STRING.
           PERFORM 300-DISPLAY-RESULT.
           STOP RUN.

       100-TAKE-NUMBER.
           DISPLAY "YOUR NUMBER IS: ".
           ACCEPT NUM.

       200-TAKE-STRING.
           DISPLAY "YOUR STRING IS: ".
           ACCEPT STR.

       300-DISPLAY-RESULT.
           DISPLAY "YOUR NUMBER IS: " NUM " AND STRING IS: " STR.
