       IDENTIFICATION DIVISION.
       PROGRAM-ID. SQUARE-AND-CUBE.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  USERINPUT PIC 9(2).
       01  SQUARE PIC 9(4).
       01  CUBE PIC 9(6).

       PROCEDURE DIVISION.
       000-MAIN-PROCEDURE.
           PERFORM 100-ACCEPT-INPUTS.
           PERFORM 200-PERFORM-OPERATIONS.
           PERFORM 300-DISPLAY-RESULTS.

       100-ACCEPT-INPUTS.
           DISPLAY "YOUR NUMBER IS: ".
           ACCEPT USERINPUT.

       200-PERFORM-OPERATIONS.
           COMPUTE SQUARE = USERINPUT ** 2.
           COMPUTE CUBE = USERINPUT ** 3.

       300-DISPLAY-RESULTS.
           DISPLAY "SQUARE OF NUMBER IS: " SQUARE.
           DISPLAY "CUBE OF NUMBER IS: " CUBE.

           STOP RUN.
