       IDENTIFICATION DIVISION.
       PROGRAM-ID. TRIGONOMETRIC-FUNCTIONS.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  ANNUITY-INSTALLMENT PIC 9(6)V9(6).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           *> SIN, COS, TAN
           *> ASIN, ACOS, ATAN
           *> Arguments must be in radians.

           DISPLAY FUNCTION SIN(3.142847/6).
           DISPLAY FUNCTION SIN(0).

           DISPLAY FUNCTION COS(3.142857/3).
           DISPLAY FUNCTION COS(0).

           DISPLAY FUNCTION TAN(3.142857/4).
           DISPLAY FUNCTION TAN(0).

           DISPLAY FUNCTION ASIN(3.142857/6).
           DISPLAY FUNCTION ASIN(45).

           DISPLAY FUNCTION ACOS(45).
           DISPLAY FUNCTION ACOS(45).

           DISPLAY FUNCTION ATAN(45).
           DISPLAY FUNCTION ATAN(45).
           STOP RUN.

       END PROGRAM TRIGONOMETRIC-FUNCTIONS.
